In [1]:
import pandas as pd
import psycopg2
import config as creds

from sqlalchemy import create_engine, Table, MetaData
meta = MetaData()

In [2]:
#[DB_TYPE]+[DB_CONNECTOR]://[USERNAME]:[PASSWORD]@[HOST]:[PORT]/[DB_NAME]
            
db_string = "postgresql://"+creds.PGUSER +":"+creds.PGPASSWORD+"@"+creds.PGHOST+":5432"   
db_string

'postgresql://postgres:project15@database-1.crzdmbvlyvqg.ca-central-1.rds.amazonaws.com:5432'

In [3]:
engine = create_engine(db_string,isolation_level="AUTOCOMMIT")
connection = engine.connect()

In [4]:
# Read csv into customerSegment_df dataframe
customerDataOriginal_df = pd.read_csv("Resources/marketing_campaign.csv")
customerDataOriginal_df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [5]:
#create Customer Service table dataframe
Cust_Service_df = customerDataOriginal_df[['ID','Complain','Response']]
Cust_Service_df

         ID  Complain  Response
0      5524         0         1
1      2174         0         0
2      4141         0         0
3      6182         0         0
4      5324         0         0
...     ...       ...       ...
2235  10870         0         0
2236   4001         0         0
2237   7270         0         0
2238   8235         0         0
2239   9405         0         1

[2240 rows x 3 columns]

In [9]:
# Df to table conversion
Cust_Service_df.to_sql('CustomerServiceTest',engine,if_exists='replace',index=False)

In [11]:
# convert table to dataframe 
pd.read_sql('SELECT * FROM "CustomerServiceTest"', connection)

         ID  Complain  Response
0      5524         0         1
1      2174         0         0
2      4141         0         0
3      6182         0         0
4      5324         0         0
...     ...       ...       ...
2235  10870         0         0
2236   4001         0         0
2237   7270         0         0
2238   8235         0         0
2239   9405         0         1

[2240 rows x 3 columns]

In [19]:
# convert customers_table to dataframe
customer_df= pd.read_sql('SELECT * FROM "customers_table"', connection)

customer_df.head()

,Customer_ID,Year_Birth,Education,Marital_Status,Income,Children_Per_Household,Teens_Per_Household
0,5524,1957,Graduation,Single,58138,0,0
1,2174,1954,Graduation,Single,46344,1,1
2,4141,1965,Graduation,Together,71613,0,0
3,6182,1984,Graduation,Together,26646,1,0
4,5324,1981,PhD,Married,58293,1,0

In [20]:
# convert orders_table to dataframe
orders_df= pd.read_sql('SELECT * FROM "orders_table"', connection)

orders_df.head()

,Customer_ID,Date_Enrolled,Recency,Deal_Purchases,Web_Purchases,Catalog_Purchases,Store_Purchases,Web_Visits
0,5524,2012-09-04,58,3,8,10,4,7
1,2174,2014-03-08,38,2,1,1,2,5
2,4141,2013-08-21,26,1,8,2,10,4
3,6182,2014-02-10,26,2,2,0,4,6
4,5324,2014-01-19,94,5,5,3,6,5

In [21]:
# convert products_table to dataframe
products_df= pd.read_sql('SELECT * FROM "products_table"', connection)

products_df.head()

   Customer_ID  Wines  Fruits  Meat  Fish  Sweets  Gold
0         5524    635      88   546   172      88    88
1         2174     11       1     6     2       1     6
2         4141    426      49   127   111      21    42
3         6182     11       4    20    10       3     5
4         5324    173      43   118    46      27    15

In [22]:
# convert customer_service_table to dataframe
customer_service_df= pd.read_sql('SELECT * FROM "customer_service_table"', connection)

customer_service_df.head()

   Customer_ID  Complain  Response
0         5524         0         1
1         2174         0         0
2         4141         0         0
3         6182         0         0
4         5324         0         0

In [95]:
connection.close()